backend/load-test/annouesment-test.yml
config:
  target: http://localhost:5000
  phases:
    - duration: 300
      arrivalRate: 1
      name: Warm up phase
    - duration: 600
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 300
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99 <= 500
      - http.response_time.mean <= 300
      - http.status.2xx >= 95

scenarios:
  - flow:
      - post:
          url: "/api/annousement"  
          json:
            title: "New Announcement Title"
            anousement: "Content of the announcement"
            semester: 1
            acYear: 2024
            faculty: "Faculty Name"
      - get:
          url: "/api/annousement"   
      - get:
          url: "/api/annousement/user-annousement"  
          headers:
            Authorization: Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY1ZmYwMTQ4MTVlMzYyNmVlMGFjOWNjMCIsImlhdCI6MTcxMTI4NjQ3NiwiZXhwIjoxNzExMzcyODc2fQ.lRBOBeNajuqERngnEhavL14AcC2uo5ju0eNuG0uKrns  # Replace YOUR_TOKEN with a valid JWT token
      - get:
          url: "/api/annousement/get-annousement"   
      - delete:
          url: "/api/annousement/65fe7b9989caaf1ac3cbff49"