backend/load-test/enroll-test.yml
config:
  target: http://localhost:5000
  phases:
    - duration: 300
      arrivalRate: 1
      name: Warm up phase
    - duration: 600
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 300
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99 <= 500
      - http.response_time.mean <= 300
      - http.status.2xx >= 95

scenarios:
  - flow:
      - post:
          url: "/api/enroll"   
          json:
            Sid: "student123"   
            semester: 1
            acYear: 2024
            faculty: "Faculty Name"
      - get:
          url: "/api/enroll"  
      - patch:
          url: "/api/enroll/65fb3471fc9d4ad4d25d4701"  
          json:
            Sid: "updated_student123"   
            semester: 2
            acYear: 2024
            faculty: "Updated Faculty Name"
      - delete:
          url: "/api/enroll/65fb3471fc9d4ad4d25d4701"