backend/load-test/user-test.yml
config:
  target: http://localhost:5000
  phases:
    - duration: 300
      arrivalRate: 1
      name: Warm up phase
    - duration: 600
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 300
      arrivalRate: 10
      rampTo: 20
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99 <= 500
      - http.response_time.mean <= 300
      - http.status.2xx >= 95

scenarios:
  - flow:
      - post:
          url: "/api/user/register"   
          json:
            name: "John Doe"
            email: "johndoe@example.com"
            password: "password"
            phone: "1234567890"
            usertype: "Student"
            faculty: "Faculty Name"
      - post:
          url: "/api/user/"  
          json:
            email: "johndoe@example.com"
            password: "password"
      - get:
          url: "/api/user/"  
      - get:
          url: "/api/user/all-users"   
      - get:
          url: "/api/user/get-user/65fdb6ee9a0b7a1763c10cca"  
      - delete:
          url: "/api/user/65fdb6ee9a0b7a1763c10cca"